app/Repository/Admin/Client/ClientRepository.php

select `id`, `name` from `users` where `users`.`id` in (1)
select count(*) as aggregate from `clients`
---
    public function index($request)
    {
        try {
            $query = Client::with(['user', 'invoices'])
                ->orderBy('created_at', 'desc');

            // Apply filters
            if ($request->has('is_active') && $request->is_active !== '') {
                $query->where('is_active', $request->is_active);
            }

            if ($request->has('search') && !empty($request->search)) {
                $query->where(function($q) use ($request) {
                    $q->where('name', 'like', "%{$request->search}%")
                      ->orWhere('email', 'like', "%{$request->search}%")
                      ->orWhere('company_name', 'like', "%{$request->search}%")
                      ->orWhere('phone', 'like', "%{$request->search}%");
                });
            }

            // Get paginated or all results
            if ($request->has('per_page')) {
                $perPage = (int) $request->per_page;
                $perPage = min($perPage, Constants::MAX_PER_PAGE);
                $perPage = max($perPage, Constants::MIN_PER_PAGE);

                $clients = $query->paginate($perPage);