app/Services/DashboardService.php

select sum(`total`) as aggregate from `invoices` where `status` = 'paid'
select sum(`total`) as aggregate from `invoices` where `status` = 'paid' and `paid_at` between '2026-04-01 00:00:00' and '2026-04-09 06:45:28'
select sum(`total`) as aggregate from `invoices` where `status` = 'paid' and `paid_at` between '2026-03-01 00:00:00' and '2026-04-01 00:00:00'
select count(*) as aggregate from `invoices`
select count(*) as aggregate from `invoices` where `created_at` between '2026-04-01 00:00:00' and '2026-04-09 06:45:28'
select count(*) as aggregate from `invoices` where `created_at` between '2026-03-01 00:00:00' and '2026-04-01 00:00:00'
---
    private function getCompleteStats($today, $currentMonth, $lastMonth)
    {
        // إجمالي الإيرادات
        $totalRevenue = (float) Invoice::where('status', 'paid')->sum('total');

        // إيرادات هذا الشهر
        $currentMonthRevenue = (float) Invoice::where('status', 'paid')
            ->whereBetween('paid_at', [$currentMonth, Carbon::now()])
            ->sum('total');

        // إيرادات الشهر الماضي
        $lastMonthRevenue = (float) Invoice::where('status', 'paid')
            ->whereBetween('paid_at', [$lastMonth, $currentMonth])
            ->sum('total');

        // نمو الإيرادات
        $revenueGrowth = $lastMonthRevenue > 0 ?
            (($currentMonthRevenue - $lastMonthRevenue) / $lastMonthRevenue) * 100 :
            ($currentMonthRevenue > 0 ? 100 : 0);

        // إجمالي الفواتير
        $totalInvoices = Invoice::count();

        // فواتير هذا الشهر
        $currentMonthInvoices = Invoice::whereBetween('created_at', [$currentMonth, Carbon::now()])->count();

        // فواتير الشهر الماضي
        $lastMonthInvoices = Invoice::whereBetween('created_at', [$lastMonth, $currentMonth])->count();

select count(*) as aggregate from `clients`
select count(*) as aggregate from `clients` where `created_at` between '2026-04-01 00:00:00' and '2026-04-09 06:45:28'
select count(*) as aggregate from `clients` where `created_at` between '2026-03-01 00:00:00' and '2026-04-01 00:00:00'
---
            ($currentMonthInvoices > 0 ? 100 : 0);

        // إجمالي العملاء
        $totalClients = Client::count();

        // عملاء هذا الشهر
        $currentMonthClients = Client::whereBetween('created_at', [$currentMonth, Carbon::now()])->count();

        // عملاء الشهر الماضي
        $lastMonthClients = Client::whereBetween('created_at', [$lastMonth, $currentMonth])->count();

select count(*) as aggregate from `invoices` where `status` = 'paid'
select count(*) as aggregate from `invoices` where `status` = 'sent'
select count(*) as aggregate from `invoices` where `status` = 'overdue'
select count(*) as aggregate from `invoices` where `status` = 'draft'
select sum(`total`) as aggregate from `invoices` where `status` = 'paid'
select sum(`total`) as aggregate from `invoices` where `status` = 'sent'
select sum(`total`) as aggregate from `invoices` where `status` = 'overdue'
select sum(`total`) as aggregate from `invoices` where `status` = 'draft'
---
            ($currentMonthClients > 0 ? 100 : 0);

        // الفواتير حسب الحالة
        $paidInvoices = Invoice::where('status', 'paid')->count();
        $pendingInvoices = Invoice::where('status', 'sent')->count();
        $overdueInvoices = Invoice::where('status', 'overdue')->count();
        $draftInvoices = Invoice::where('status', 'draft')->count();

        // المبالغ حسب الحالة
        $paidAmount = (float) Invoice::where('status', 'paid')->sum('total');
        $pendingAmount = (float) Invoice::where('status', 'sent')->sum('total');
        $overdueAmount = (float) Invoice::where('status', 'overdue')->sum('total');
        $draftAmount = (float) Invoice::where('status', 'draft')->sum('total');

select AVG(total) as avg_revenue from `invoices` where `status` = 'paid' limit 1
select count(*) as aggregate from `invoices` where `status` = 'paid' and date(`paid_at`) = '2026-04-09'
select count(*) as aggregate from `invoices` where date(`created_at`) = '2026-04-09'
---
        $paymentRate = $totalInvoices > 0 ? ($paidInvoices / $totalInvoices) * 100 : 0;

        // متوسط الإيرادات الشهرية
        $avgResult = Invoice::where('status', 'paid')
            ->select(DB::raw('AVG(total) as avg_revenue'))
            ->first();
        $avgMonthlyRevenue = $avgResult ? (float) $avgResult->avg_revenue : 0;

        // إحصائيات اليوم
        $todayPaidInvoices = Invoice::where('status', 'paid')
            ->whereDate('paid_at', $today)
            ->count();

        $todayTotalInvoices = Invoice::whereDate('created_at', $today)->count();

select * from `clients` order by `created_at` desc limit 5
select sum(`total`) as aggregate from `invoices` where `client_id` = 23 and `status` = 'paid'
select count(*) as aggregate from `invoices` where `client_id` = 23
---
    private function getRecentClients($limit = 5)
    {
        return Client::latest()
            ->take($limit)
            ->get()
            ->map(function ($client) {
                // حساب إجمالي الإنفاق
                $totalSpent = Invoice::where('client_id', $client->id)
                    ->where('status', 'paid')
                    ->sum('total');

                // حساب إجمالي الفواتير
                $totalInvoices = Invoice::where('client_id', $client->id)->count();

                // حساب النمو (افتراضي)
                $growth = rand(5, 25);

                return [
                    'id' => $client->id,
                    'name' => $client->name,
                    'email' => $client->email,
                    'phone' => $client->phone,
                    'company_name' => $client->company_name ?: 'غير محدد',
                    'status' => $client->status ?: 'active',
                    'total_spent' => (float) $totalSpent,

select * from `clients` where `clients`.`id` in (6, 12, 17, 19, 23)
select * from `invoices` order by `created_at` desc limit 5
---
    private function getRecentInvoices($limit = 5)
    {
        return Invoice::with('client')
            ->latest()
            ->take($limit)
            ->get()
            ->map(function ($invoice) {
                return [
                    'id' => $invoice->id,
                    'invoice_number' => $invoice->invoice_number,
                    'client_name' => $invoice->client ? $invoice->client->name : 'غير محدد',
                    'client_company' => $invoice->client ? $invoice->client->company_name : 'غير محدد',
                    'total' => (float) $invoice->total,
                    'status' => $invoice->status,
                    'issue_date' => $invoice->issue_date,
                    'due_date' => $invoice->due_date,
                    'paid_at' => $invoice->paid_at,
                    'created_at' => $invoice->created_at->format('Y-m-d H:i:s'),
                ];
            })->toArray();

select DATE_FORMAT(paid_at, "%Y-%m") as month, SUM(total) as revenue, COUNT(*) as invoice_count from `invoices` where `status` = 'paid' and `paid_at` >= '2025-10-01 00:00:00' group by `month` order by `month` asc
---
    private function getMonthlyRevenue($startDate)
    {
        $revenues = Invoice::where('status', 'paid')
            ->where('paid_at', '>=', $startDate)
            ->select(
                DB::raw('DATE_FORMAT(paid_at, "%Y-%m") as month'),
                DB::raw('SUM(total) as revenue'),
                DB::raw('COUNT(*) as invoice_count')
            )
            ->groupBy('month')
            ->orderBy('month')
            ->get();

select * from `invoices` where `status` = 'overdue' order by `created_at` desc
---
    private function getOverdueInvoices()
    {
        return Invoice::where('status', 'overdue')
            ->with('client')
            ->latest()
            ->get()
            ->map(function ($invoice) {
                $daysOverdue = $invoice->due_date ?
                    Carbon::parse($invoice->due_date)->diffInDays(Carbon::now()) : 0;

                return [
                    'id' => $invoice->id,
                    'invoice_number' => $invoice->invoice_number,
                    'client_name' => $invoice->client ? $invoice->client->name : 'غير محدد',
                    'total' => (float) $invoice->total,
                    'due_date' => $invoice->due_date,
                    'days_overdue' => $daysOverdue,
                    'created_at' => $invoice->created_at->format('Y-m-d H:i:s'),
                ];
            })->toArray();

select * from `clients` where `clients`.`id` in (3, 4, 6, 12, 15, 17, 19, 23)
select * from `invoices` order by `created_at` desc limit 10
select * from `invoices` where `status` = 'paid' order by `created_at` desc limit 3
---
    private function getRecentActivity($limit = 10)
    {
        // نحاول جلب النشاط من سجلات الفواتير
        $recentInvoices = Invoice::with('client')
            ->latest()
            ->take($limit)
            ->get();

        $activities = [];
        $counter = 1;

        foreach ($recentInvoices as $invoice) {
            $activities[] = [
                'id' => $counter++,
                'type' => 'invoice_created',
                'title' => 'فاتورة جديدة',
                'description' => 'فاتورة #' . $invoice->invoice_number . ' تم إنشاؤها للعميل ' . ($invoice->client->name ?? 'غير محدد'),
                'amount' => (float) $invoice->total,
                'user_name' => 'النظام',
                'invoiceId' => $invoice->invoice_number,
                'timestamp' => $invoice->created_at->timestamp,
                'created_at' => $invoice->created_at->format('Y-m-d H:i:s'),
            ];
        }

        // إضافة نشاطات للفواتير المدفوعة
        $paidInvoices = Invoice::where('status', 'paid')
            ->latest()
            ->take(3)
            ->get();

select * from `clients` order by `created_at` desc limit 2
---
        }

        // إضافة نشاطات للعملاء الجدد
        $recentClients = Client::latest()->take(2)->get();

select * from `clients`
select sum(`total`) as aggregate from `invoices` where `client_id` = 2 and `status` = 'paid'
---
    private function getTopClients($limit = 5)
    {
        return Client::all()
            ->map(function ($client) {
                $totalSpent = Invoice::where('client_id', $client->id)
                    ->where('status', 'paid')
                    ->sum('total');

                // حساب النمو (افتراضي)
                $growth = rand(5, 25);

                return [
                    'id' => $client->id,
                    'name' => $client->name,
                    'company_name' => $client->company_name ?: 'غير محدد',
                    'total_spent' => (float) $totalSpent,
                    'growth' => $growth,
                    'created_at' => $client->created_at->format('Y-m-d H:i:s'),
                ];
            })
            ->sortByDesc('total_spent')
            ->take($limit)
            ->values()

select DATE_FORMAT(paid_at, "%Y-%m") as month, COUNT(*) as invoice_count, SUM(total) as revenue from `invoices` where `paid_at` >= '2025-10-01 00:00:00' group by `month` order by `month` asc
---
    private function getPerformanceData($startDate)
    {
        $data = Invoice::where('paid_at', '>=', $startDate)
            ->select(
                DB::raw('DATE_FORMAT(paid_at, "%Y-%m") as month'),
                DB::raw('COUNT(*) as invoice_count'),
                DB::raw('SUM(total) as revenue')
            )
            ->groupBy('month')
            ->orderBy('month')
            ->get();