app/Repository/Admin/User/UserRepository.php

select * from `admin_groups` where `admin_groups`.`id` in (1, 3, 4)
select * from `users` order by `created_at` desc limit 100 offset 0
select count(*) as aggregate from `users`
---
    public function index($request)
    {
        try {
            $query = User::with(['adminGroup', 'branches'])
                ->orderBy('created_at', 'desc');

            // Apply filters
            if ($request->has('is_active')) {
                $query->where('is_active', $request->is_active);
            }

            if ($request->has('admin_group_id')) {
                $query->where('admin_group_id', $request->admin_group_id);
            }

            if ($request->has('search')) {
                $query->where(function($q) use ($request) {
                    $q->where('name', 'like', "%{$request->search}%")
                      ->orWhere('email', 'like', "%{$request->search}%");
                });
            }

            // Get paginated or all results
            if ($request->has('per_page')) {
                $users = $query->paginate(
                    min($request->per_page, Constants::MAX_PER_PAGE)
                );