app/Repository/Admin/AdminGroup/AdminGroupRepository.php

select count(*) as aggregate from `admin_groups`
---
    public function index($request)
    {
        try {
            $query = AdminGroup::withCount(['users', 'permissions']);

            // Apply search filter
            if ($request->has('search') && !empty($request->search)) {
                $search = $request->search;
                $query->where(function($q) use ($search) {
                    $q->where('title_en', 'like', "%{$search}%")
                      ->orWhere('title_ar', 'like', "%{$search}%")
                      ->orWhere('description', 'like', "%{$search}%");
                });
            }

            // Apply status filter
            if ($request->has('is_active') && $request->is_active !== '') {
                $query->where('is_active', (bool)$request->is_active);
            }

            // Exclude system groups if needed
            if ($request->has('exclude_system') && $request->exclude_system) {
                $query->where('is_system', false);
            }

            // Get paginated results
            $perPage = $request->per_page ?? Constants::DEFAULT_PER_PAGE;
            $perPage = min($perPage, Constants::MAX_PER_PAGE);
            $perPage = max($perPage, Constants::MIN_PER_PAGE);

            $adminGroups = $query->orderBy('created_at', 'desc')->paginate($perPage);