app/Repository/Admin/Permission/PermissionRepository.php

select * from `admin_permissions` order by `admin_menu_id` asc, `admin_sub_menu_id` asc, `parent_id` asc, `title` asc limit 10 offset 0
select count(*) as aggregate from `admin_permissions`
---
    public function index($request)
    {
        try {
            $query = AdminPermission::with(['menu', 'subMenu', 'parent']);

            // Apply search filter
            if ($request->has('search') && !empty($request->search)) {
                $search = $request->search;
                $query->where(function($q) use ($search) {
                    $q->where('title', 'like', "%{$search}%")
                      ->orWhere('description_en', 'like', "%{$search}%")
                      ->orWhere('description_ar', 'like', "%{$search}%");
                });
            }

            // Apply status filter
            if ($request->has('is_active') && $request->is_active !== '') {
                $query->where('is_active', (bool)$request->is_active);
            }

            // Get paginated results
            $perPage = $request->per_page ?? Constants::DEFAULT_PER_PAGE;
            $perPage = min($perPage, Constants::MAX_PER_PAGE);
            $perPage = max($perPage, Constants::MIN_PER_PAGE);

            $permissions = $query->orderBy('admin_menu_id')
                ->orderBy('admin_sub_menu_id')
                ->orderBy('parent_id')
                ->orderBy('title')
                ->paginate($perPage);