app/Http/Controllers/Admin/ActivityLogController.php

    public function index(Request $request)
    {
        $query = ActivityLog::with('user')
            ->orderBy('created_at', 'desc');

        // فلترة حسب البحث
        if ($request->filled('search')) {
            $query->where('description', 'like', '%' . $request->search . '%');
        }

        // فلترة حسب نوع الإجراء
        if ($request->filled('action')) {
            $query->where('action', $request->action);
        }

        // فلترة حسب المستخدم
        if ($request->filled('user_id')) {
            $query->where('user_id', $request->user_id);
        }

        // فلترة حسب التاريخ
        if ($request->filled('date_from')) {
            $query->whereDate('created_at', '>=', $request->date_from);
        }
        if ($request->filled('date_to')) {
            $query->whereDate('created_at', '<=', $request->date_to);
        }

        $perPage = $request->per_page ?? Constants::DEFAULT_PER_PAGE;
        $logs = $query->paginate($perPage);
---
select * from `activity_logs` order by `created_at` desc limit 10 offset 0
select * from `users` where `users`.`id` in (1)
select count(*) as aggregate from `activity_logs`