app/Http/Controllers/Admin/AuthController.php

            $attemptsKey = 'login_attempts_' . md5($ip . $email);
            $attempts    = Cache::get($attemptsKey, 0);

            $user = User::with(['adminGroup.permissions'])
                ->where('email', $email)
                ->first();
---
select * from `admin_groups` where `admin_groups`.`id` in (1)
select * from `users` where `email` = 'admin@invoice.com' limit 1

    public function logout(Request $request)
    {
        try {
            $request->user()->currentAccessToken()->delete();
---
delete from `personal_access_tokens` where `id` = 105

    private function getUserPermissions(User $user): array
    {
        try {
            if ($user->admin_group_id == Constants::SUPER_ADMIN_GROUP_ID) {
                return AdminPermission::where('is_active', true)->pluck('title')->toArray();
---
select `title` from `admin_permissions` where `is_active` = 1