app/Http/Controllers/Admin/PermissionController.php

select * from `admin_menus` where `is_active` = 1 order by `sort_order` asc
---
    public function menus()
    {
        if (!PermissionHelper::checkPermission(Constants::MANAGE_PERMISSIONS)) {
            return $this->failureResponse(
                __('messages.no_permission'),
                null,
                Constants::RESPONSE_FORBIDDEN
            );
        }

        $menus = AdminMenu::with(['subMenus' => function ($query) {
                $query->where('is_active', 1)->orderBy('sort_order');
            }])
            ->where('is_active', 1)
            ->orderBy('sort_order')
            ->get();