app/Http/Controllers/Admin/UserController.php

select * from `admin_groups` where `admin_groups`.`id` in (1)
---
    public function profile()
    {
        $user = auth()->user()->load('adminGroup.permissions');